Revit 2026 API
MassSurfaceData.Area Property
 Area of the references that the MassSurfaceData provides properties for.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
Remarks
 If it is used, should be greater than zero. Otherwise, it will be zero.
See Also
Reference
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace